# データ点の数 - 1
use constant N => 6;

my @x = ();
my @y = ();

# 1.5刻みで -4.5～4.5 まで, ７点だけ値をセット
for $i (0..N)
{
    my $d1 = $i * 1.5 - 4.5;
    $x[$i] = $d1;
    $y[$i] = f($d1);
}

# ３項方程式の係数の表を作る
my @a = ();
my @b = ();
my @c = ();
my @d = ();
for $i (1..(N - 1))
{
    $a[$i] =         $x[$i]   - $x[$i-1]; 
    $b[$i] = 2.0 *  ($x[$i+1] - $x[$i-1]); 
    $c[$i] =         $x[$i+1] - $x[$i]; 
    $d[$i] = 6.0 * (($y[$i+1] - $y[$i]) / ($x[$i+1] - $x[$i]) - ($y[$i] - $y[$i-1]) / ($x[$i] - $x[$i-1]));
}
# ３項方程式を解く (ト－マス法)
my @g = ();
my @s = ();
$g[1] = $b[1];
$s[1] = $d[1];
for $i (2..(N - 1))
{
    $g[$i] = $b[$i] - $a[$i] * $c[$i-1] / $g[$i-1];
    $s[$i] = $d[$i] - $a[$i] * $s[$i-1] / $g[$i-1];
}
my @z = ();
$z[0] = 0;
$z[N] = 0;
$z[N-1] = $s[N-1] / $g[N-1];
for ($i = N - 2; $i >= 1; $i--)
{
    $z[$i] = ($s[$i] - $c[$i] * $z[$i+1]) / $g[$i];
}

# 0.5刻みで 与えられていない値を補間 
for $i (0..18)
{
    my $d1 = $i * 0.5 - 4.5;
    my $d2 = f($d1);
    my $d3 = spline($d1, \@x, \@y, \@z);

    # 元の関数と比較
    printf("%5.2f\t%8.5f\t%8.5f\t%8.5f\n", $d1, $d2, $d3, $d2 - $d3);
}

# 元の関数
sub f
{
	my ($x) = @_;
    $x - ($x ** 3) / (3 * 2) + ($x ** 5) / (5 * 4 * 3 * 2);
}

# Spline (スプライン) 補間
sub spline
{
	my ($d, $x, $y, $z) = @_;
	
    # 補間関数値がどの区間にあるか
    my $k = -1;
	for $i (1..N)
	{
        if ($d <= $$x[$i])
        {
            $k = $i - 1;
            last;
        }
    }
    if ($k < 0)
	{
		$k = N;
	}

    $d1 = $$x[$k+1] - $d;
    $d2 = $d        - $$x[$k];
    $d3 = $$x[$k+1] - $$x[$k];
    ($$z[$k] * ($d1 ** 3) + $$z[$k+1] * ($d2 ** 3)) / (6.0 * $d3) +
    ($$y[$k]   / $d3 - $$z[$k]   * $d3 / 6.0) * $d1 + 
    ($$y[$k+1] / $d3 - $$z[$k+1] * $d3 / 6.0) * $d2;
}
